; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
)
(:goal (and
	(have_image Phenomenon8 spectrograph0)
	(have_image Phenomenon9 spectrograph1)
	(have_image Planet10 spectrograph0)
	(have_image Star11 spectrograph1)
	(have_image Phenomenon12 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Star14 spectrograph1)
	(have_image Star15 spectrograph0)
	(have_image Star16 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation0 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 phenomenon9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 9
5. (take_image satellite0 phenomenon9 instrument0 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon8 instrument0 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon12 instrument0 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 3 of 9
10. (turn_to satellite0 planet10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet10)
   goals met: 3 of 9
11. (take_image satellite0 planet10 instrument0 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 4 of 9
12. (turn_to satellite0 star11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star11)
   goals met: 4 of 9
13. (take_image satellite0 star11 instrument0 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 5 of 9
14. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 5 of 9
15. (take_image satellite0 star13 instrument0 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 6 of 9
16. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 6 of 9
17. (take_image satellite0 star14 instrument0 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 7 of 9
18. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 7 of 9
19. (take_image satellite0 star15 instrument0 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 8 of 9
20. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 8 of 9
21. (take_image satellite0 star16 instrument0 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 9 of 9
